// ======================================================
// IPhaseState.cs
// 作成者   : 高橋一翔
// 作成日時 : 2026-03-23
// 更新日時 : 2026-03-23
// 概要     : フェーズごとの振る舞いを定義するインターフェース
// ======================================================

namespace PhaseSystem.Domain
{
    /// <summary>
    /// フェーズごとの振る舞いを定義するインターフェース
    /// </summary>
    public interface IPhaseState
    {
        // ======================================================
        // プロパティ
        // ======================================================

        /// <summary>フェーズ経過時間</summary>
        float ElapsedTime { get; }

        // ======================================================
        // パブリックメソッド
        // ======================================================

        /// <summary>
        /// フェーズ開始時処理
        /// </summary>
        void OnEnter();

        /// <summary>
        /// フェーズ終了時処理
        /// </summary>
        void OnExit();
        
        /// <summary>
        /// フェーズ更新処理
        /// </summary>
        void OnUpdate(in float unscaledDeltaTime);
    }
}