// ======================================================
// IPhaseEnterHandler.cs
// 作成者   : 高橋一翔
// 作成日時 : 2026-04-20
// 更新日時 : 2026-04-20
// 概要     : フェーズ開始時に遷移情報を受け取る処理を定義するインターフェース
// ======================================================

namespace PhaseSystem.Domain
{
    /// <summary>
    /// フェーズ開始時に遷移元フェーズ情報を受け取るハンドラインターフェース
    /// </summary>
    public interface IPhaseEnterHandler
    {
        // ======================================================
        // パブリックメソッド
        // ======================================================

        /// <summary>
        /// フェーズ開始時処理
        /// 遷移元フェーズ付き
        /// </summary>
        /// <param name="previousPhase">遷移元のフェーズ種別</param>
        void OnEnterState(in PhaseType previousPhase);
    }
}
