// ======================================================
// IOptionSelectionIndexReader.cs
// 作成者   : 高橋一翔
// 作成日時 : 2026-05-13
// 更新日時 : 2026-05-13
// 概要     : オプション選択インデックス取得インターフェース
// ======================================================

namespace OptionSystem.Domain
{
    /// <summary>
    /// オプション選択インデックス取得インターフェース
    /// </summary>
    public interface IOptionSelectionIndexReader
    {
        // ======================================================
        // パブリックメソッド
        // ======================================================

        /// <summary>
        /// 選択インデックス取得
        /// </summary>
        int Get(in OptionType type);
    }
}