// ======================================================
// BoardInputType.cs
// 作成者   : 高橋一翔
// 作成日時 : 2026-06-23
// 更新日時 : 2026-06-23
// 概要     : ボード操作入力種別
// ======================================================

namespace BoardSystem.Domain
{
    // ======================================================
    // 列挙型
    // ======================================================

    /// <summary>
    /// ボード操作入力種別
    /// </summary>
    public enum BoardInputType
    {
        /// <summary>駒落下入力</summary>
        Drop = 0,

        /// <summary>ボード回転入力</summary>
        Rotate = 1
    }
}