// ======================================================
// CanvasType.cs
// 作成者   : 高橋一翔
// 作成日時 : 2026-05-13
// 更新日時 : 2026-05-13
// 概要     : キャンバス種別を定義する列挙型
// ======================================================

namespace UISystem.Domain
{
    // ======================================================
    // 列挙型
    // ======================================================

    /// <summary>
    /// キャンバス種別
    /// </summary>
    public enum CanvasType
    {
        /// <summary>未選択状態</summary>
        None,

        /// <summary>スタートキャンバス</summary>
        Start,

        /// <summary>オプションキャンバス</summary>
        Option,

        /// <summary>ダイアログキャンバス</summary>
        Dialog
    }
}